ОсновныеОбъектыПоМетодичке/src/DataProcessors/РегистрыСведений/РегистрыСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РегистрыСведений</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ОсновныеОбъектыПоМетодичке/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОсновныеОбъектыПоМетодичке/src/DataProcessors/РегистрыСведений/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьДанныеНаСервере()

	Отбор = Новый Структура("Валюта", Объект.Валюта);
	
	ВыборкаКурсов = РегистрыСведений.КурсыВалют.Выбрать(,Дата,Отбор);
	
	Результат = "";
	
	Пока ВыборкаКурсов.Следующий() Цикл
	
		Результат = Результат + Строка(ВыборкаКурсов.Курс) + "; ";
		
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьКурсНаСервере()
	
	Отбор = Новый Структура("Валюта", Объект.Валюта);
	
	Запись = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата,Отбор);
	
	Результат = Строка(Запись.Курс) + " : " + Строка(Запись.Кратность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКурс(Команда)
	ПолучитьКурсНаСервере();
КонецПроцедуры

&НаСервере
Процедура КурсЗапросомНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Период,
		|	КурсыВалютСрезПоследних.Курс,
		|	КурсыВалютСрезПоследних.Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Результат = Строка(ВыборкаДетальныеЗаписи.Курс) + " : " + Строка(ВыборкаДетальныеЗаписи.Кратность);
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
КонецПроцедуры

&НаКлиенте
Процедура КурсЗапросом(Команда)
	КурсЗапросомНаСервере();
КонецПроцедуры
